---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.ProjectionMethod
source: html/7ef444fb-891e-7100-f702-ba5d09d4a607.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.ProjectionMethod Property

Projection method

## Syntax (C#)
```csharp
public ProjectionMethod ProjectionMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration